ZhuYanzhen1/MM32_CLion/system/include/reg_adc.h
#define  ADC_SREXT_EOSMPIF_Pos       (16)
#define  ADC_SREXT_EOSMPIF           (0x01U << ADC_SREXT_EOSMPIF_Pos)       ///< End of sampling interrupt flag
#define  ADC_SREXT_EOCIF_Pos         (17)
#define  ADC_SREXT_EOCIF             (0x01U << ADC_SREXT_EOCIF_Pos)         ///< End of conversion interrupt flag
#define  ADC_SREXT_JEOSMPIF_Pos      (18)
#define  ADC_SREXT_JEOSMPIF          (0x01U << ADC_SREXT_JEOSMPIF_Pos)      /// Injected channel end of sampling interrupt flag
#define  ADC_SREXT_JEOCIF_Pos        (19)
#define  ADC_SREXT_JEOCIF            (0x03U << ADC_SREXT_JEOCIF_Pos)        ///< Injected channel end of conversion interrupt flag
#define  ADC_SREXT_JEOSIF_Pos        (20)
#define  ADC_SREXT_JEOSIF            (0x03U << ADC_SREXT_JEOSIF_Pos)        ///< Injected channel end of sequential conversion interrupt flag
#define  ADC_SREXT_JBUSY_Pos         (21)
#define  ADC_SREXT_JBUSY             (0x01U << ADC_SREXT_JBUSY_Pos)         ///< Injection mode busy/idle

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHANY0 select Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC1_CHANY0_SEL0_Pos        (0)                                     ///< CHANY_SEL0 (Bit 0)
#define ADC1_CHANY0_SEL0            (0x0FU << ADC1_CHANY0_SEL0_Pos)         ///< CHANY_SEL0 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL1_Pos        (4)                                     ///< CHANY_SEL1 (Bit 4)
#define ADC1_CHANY0_SEL1            (0x0FU << ADC1_CHANY0_SEL1_Pos)         ///< CHANY_SEL1 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL2_Pos        (8)                                     ///< CHANY_SEL2 (Bit 8)
#define ADC1_CHANY0_SEL2            (0x0FU << ADC1_CHANY0_SEL2_Pos)         ///< CHANY_SEL2 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL3_Pos        (12)                                    ///< CHANY_SEL3 (Bit 12)
#define ADC1_CHANY0_SEL3            (0x0FU << ADC1_CHANY0_SEL3_Pos)         ///< CHANY_SEL3 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL4_Pos        (16)                                    ///< CHANY_SEL4 (Bit 16)
#define ADC1_CHANY0_SEL4            (0x0FU << ADC1_CHANY0_SEL4_Pos)         ///< CHANY_SEL4 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL5_Pos        (20)                                    ///< CHANY_SEL5 (Bit 20)
#define ADC1_CHANY0_SEL5            (0x0FU << ADC1_CHANY0_SEL5_Pos)         ///< CHANY_SEL5 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL6_Pos        (24)                                    ///< CHANY_SEL6 (Bit 24)
#define ADC1_CHANY0_SEL6            (0x0FU << ADC1_CHANY0_SEL6_Pos)         ///< CHANY_SEL6 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL7_Pos        (28)                                    ///< CHANY_SEL7 (Bit 28)
#define ADC1_CHANY0_SEL7            (0x0FU << ADC1_CHANY0_SEL7_Pos)         ///< CHANY_SEL7 (Bitfield-Mask: 0x0f)

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHANY1 select Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC1_CHANY1_SEL8_Pos        (0)                                     ///< CHANY_SEL8 (Bit 0)
#define ADC1_CHANY1_SEL8            (0x0FU << ADC1_CHANY1_SEL8_Pos)         ///< CHANY_SEL8 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL9_Pos        (4)                                     ///< CHANY_SEL9 (Bit 4)
#define ADC1_CHANY1_SEL9            (0x0FU << ADC1_CHANY1_SEL9_Pos)         ///< CHANY_SEL9 (Bitfield-Mask: 0x0f)

#define ADC1_CHANY1_SEL14_Pos       (24)                                    ///< CHANY_SEL14 (Bit 24)
#define ADC1_CHANY1_SEL14           (0x0FU << ADC1_CHANY1_SEL14_Pos)        ///< CHANY_SEL14 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL15_Pos       (28)                                    ///< CHANY_SEL15 (Bit 28)
#define ADC1_CHANY1_SEL15           (0x0FU << ADC1_CHANY1_SEL15_Pos)        ///< CHANY_SEL15 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL10_Pos       (8)                                     ///< CHANY_SEL10 (Bit 8)
#define ADC1_CHANY1_SEL10           (0x0FU << ADC1_CHANY1_SEL10_Pos)         ///< CHANY_SEL10 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL11_Pos       (12)                                    ///< CHANY_SEL11 (Bit 12)
#define ADC1_CHANY1_SEL11           (0x0FU << ADC1_CHANY1_SEL11_Pos)        ///< CHANY_SEL11 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL12_Pos       (16)                                    ///< CHANY_SEL12 (Bit 16)
#define ADC1_CHANY1_SEL12           (0x0FU << ADC1_CHANY1_SEL12_Pos)        ///< CHANY_SEL12 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL13_Pos       (20)                                    ///< CHANY_SEL13 (Bit 20)
#define ADC1_CHANY1_SEL13           (0x0FU << ADC1_CHANY1_SEL13_Pos)        ///< CHANY_SEL13 (Bitfield-Mask: 0x0f)
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHANY config number Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC1_CHANY_CFG_NUM_Max      (16)                                    ///< CHANY_CFG_NUM Max Value is 16

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHANY mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC1_CHANY_CR_MDEN_Pos      (0)                                     ///< CHANY_MDEN (Bit 0)
#define ADC1_CHANY_CR_MDEN          (0x01U << ADC1_CHANY_CR_MDEN_Pos)       ///< CHANY_MDEN (Bitfield-Mask: 0x01)


////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_ANY_CR mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_ANY_CR_JTRGEDGE_Pos      (16)                                     ///< Injection mode triggers edge selection
#define ADC_ANY_CR_JTRGEDGE_R_F      (0x00U << ADC_ANY_CR_JTRGEDGE_Pos)       ///< Triggered along both rising and falling edges
#define ADC_ANY_CR_JTRGEDGE_F        (0x01U << ADC_ANY_CR_JTRGEDGE_Pos)       ///< Drop edge trigger
#define ADC_ANY_CR_JTRGEDGE_R        (0x02U << ADC_ANY_CR_JTRGEDGE_Pos)       ///< Rising edge trigger
#define ADC_ANY_CR_JTRGEDGE_S        (0x03U << ADC_ANY_CR_JTRGEDGE_Pos)       ///< Shield trigger

#define ADC_ANY_CR_JTRGSHIFT_Pos      (13)                                     ///< Injection mode external trigger delay sampling
#define ADC_ANY_CR_JTRGSHIFT_0        (0x00U << ADC_ANY_CR_JTRGSHIFT_Pos)      ///< 0   cycle
#define ADC_ANY_CR_JTRGSHIFT_4        (0x01U << ADC_ANY_CR_JTRGSHIFT_Pos)      ///< 4   cycle
#define ADC_ANY_CR_JTRGSHIFT_16       (0x02U << ADC_ANY_CR_JTRGSHIFT_Pos)      ///< 16  cycle
#define ADC_ANY_CR_JTRGSHIFT_32       (0x03U << ADC_ANY_CR_JTRGSHIFT_Pos)      ///< 32  cycle
#define ADC_ANY_CR_JTRGSHIFT_64       (0x04U << ADC_ANY_CR_JTRGSHIFT_Pos)      ///< 64  cycle
#define ADC_ANY_CR_JTRGSHIFT_128      (0x05U << ADC_ANY_CR_JTRGSHIFT_Pos)      ///< 128 cycle
#define ADC_ANY_CR_JTRGSHIFT_256      (0x06U << ADC_ANY_CR_JTRGSHIFT_Pos)      ///< 256 cycle
#define ADC_ANY_CR_JTRGSHIFT_512      (0x07U << ADC_ANY_CR_JTRGSHIFT_Pos)      ///< 512 cycle

